---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.WaterLoopData.Dispose
source: html/80b5319c-2076-8282-51ef-9c79acba41e8.htm
---
# Autodesk.Revit.DB.Mechanical.WaterLoopData.Dispose Method

Releases all resources used by the WaterLoopData

## Syntax (C#)
```csharp
public void Dispose()
```